
#language: ru

@tree

Функциональность: открытие всех форм справочников и документов

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "Банки" 

	Дано Я открываю основную форму списка справочника "Банки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Банки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Банки"

	Дано Я открываю основную форму справочника "Банки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Банки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Валюты" 

	Дано Я открываю основную форму списка справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Валюты"

	Дано Я открываю основную форму справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЦен" 

	Дано Я открываю основную форму списка справочника "ВидыЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦен"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЦен"

	Дано Я открываю основную форму справочника "ВидыЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦен"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Встречи" 

	Дано Я открываю основную форму списка справочника "Встречи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Встречи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Встречи"

	Дано Я открываю основную форму справочника "Встречи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Встречи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВходящиеПисьма" 

	Дано Я открываю основную форму списка справочника "ВходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВходящиеПисьма"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВходящиеПисьма"

	Дано Я открываю основную форму справочника "ВходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВходящиеПисьма"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияХарактеристик" 

	Дано Я открываю основную форму списка справочника "ЗначенияХарактеристик"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияХарактеристик"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияХарактеристик"

	Дано Я открываю основную форму справочника "ЗначенияХарактеристик"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияХарактеристик"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсходящиеПисьма" 

	Дано Я открываю основную форму списка справочника "ИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсходящиеПисьма"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсходящиеПисьма"

	Дано Я открываю основную форму справочника "ИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсходящиеПисьма"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Контрагенты" 

	Дано Я открываю основную форму списка справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Контрагенты"

	Дано Я открываю основную форму справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МобильныеУстройства" 

	Дано Я открываю основную форму списка справочника "МобильныеУстройства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МобильныеУстройства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МобильныеУстройства"

	Дано Я открываю основную форму справочника "МобильныеУстройства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МобильныеУстройства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиТорговогоОборудования" 

	Дано Я открываю основную форму списка справочника "НастройкиТорговогоОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиТорговогоОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиТорговогоОборудования"

	Дано Я открываю основную форму справочника "НастройкиТорговогоОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиТорговогоОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Организации" 

	Дано Я открываю основную форму списка справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Организации"

	Дано Я открываю основную форму справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Пользователи" 

	Дано Я открываю основную форму списка справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Пользователи"

	Дано Я открываю основную форму справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПочтовыеВложения" 

	Дано Я открываю основную форму списка справочника "ПочтовыеВложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПочтовыеВложения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПочтовыеВложения"

	Дано Я открываю основную форму справочника "ПочтовыеВложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПочтовыеВложения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетныеСчета" 

	Дано Я открываю основную форму списка справочника "РасчетныеСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РасчетныеСчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетныеСчета"

	Дано Я открываю основную форму справочника "РасчетныеСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РасчетныеСчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасчетныеСчетаКонтрагентов" 

	Дано Я открываю основную форму списка справочника "РасчетныеСчетаКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РасчетныеСчетаКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасчетныеСчетаКонтрагентов"

	Дано Я открываю основную форму справочника "РасчетныеСчетаКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РасчетныеСчетаКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Регионы" 

	Дано Я открываю основную форму списка справочника "Регионы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Регионы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Регионы"

	Дано Я открываю основную форму справочника "Регионы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Регионы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Склады" 

	Дано Я открываю основную форму списка справочника "Склады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Склады"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Склады"

	Дано Я открываю основную форму справочника "Склады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Склады"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Товары" 

	Дано Я открываю основную форму списка справочника "Товары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Товары"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Товары"

	Дано Я открываю основную форму справочника "Товары"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Товары"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранилищеВариантовОтчетов" 

	Дано Я открываю основную форму списка справочника "ХранилищеВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХранилищеВариантовОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранилищеВариантовОтчетов"

	Дано Я открываю основную форму справочника "ХранилищеВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХранилищеВариантовОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранимыеФайлы" 

	Дано Я открываю основную форму списка справочника "ХранимыеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХранимыеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранимыеФайлы"

	Дано Я открываю основную форму справочника "ХранимыеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХранимыеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Заказ" 

	Дано Я открываю основную форму списка документа "Заказ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Заказ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Заказ"

	Дано Я открываю основную форму документа "Заказ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Заказ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияПоУчетуТоваров" 

	Дано Я открываю основную форму списка документа "ОперацияПоУчетуТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоУчетуТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияПоУчетуТоваров"

	Дано Я открываю основную форму документа "ОперацияПоУчетуТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоУчетуТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Оплата" 

	Дано Я открываю основную форму списка документа "Оплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Оплата"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Оплата"

	Дано Я открываю основную форму документа "Оплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Оплата"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеДенег" 

	Дано Я открываю основную форму списка документа "ПоступлениеДенег"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеДенег"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеДенег"

	Дано Я открываю основную форму документа "ПоступлениеДенег"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеДенег"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходТовара" 

	Дано Я открываю основную форму списка документа "ПриходТовара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходТовара"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходТовара"

	Дано Я открываю основную форму документа "ПриходТовара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходТовара"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходТовара" 

	Дано Я открываю основную форму списка документа "РасходТовара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходТовара"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходТовара"

	Дано Я открываю основную форму документа "РасходТовара"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходТовара"
	И Я закрываю текущее окно

